export const TOP5Config = {
  '销售': {
    key1: '销售(万元)',
    align: 'right'
  },
  '考核': {
    key2: '考核',
    align: 'right'
  },
  '客流': {
    key3: '客流(万人)',
    align: 'left'
  },
  '平均租金(权责)': {
    key4: '平均租金(元/㎡)',
    align: 'right'
  },
  '租金收入': {
    key5: '租金收入(万元)',
    align: 'right'
  },
  '物管收入': {
    key6: '物管收入(万元)',
    align: 'right'
  },
  '多经收入': {
    key7: '多经收入(万元)',
    align: 'right'
  },
  '车流': {
    key8: '车流(万)',
    align: 'left'
  },
  '会员': {
    key9: '会员(人)',
    align: 'left'
  },
  '租约到期': {
    key10: '到期面积(㎡)',
    align: 'left'
  },
  '欠费': {
    key11: '累计差额(万元)',
    align: 'right'
  }
}
export const TOP5Data = [
  {
    sortIndex: 1,
    name: '上海',
    key1: '829.12',
    key2: '100%',
    key3: '10.27',
    key4: '122.60',
    key5: '5,798.48',
    key6: '4,696.76',
    key7: '5,218.63',
    key8: '11.09',
    key9: '4,670',
    key10: '81,977.90',
    key11: '3,899.22'
  },
  {
    sortIndex: 2,
    name: '杭州',
    key1: '732.00',
    key2: '96.21%',
    key3: '9.94',
    key4: '102.70',
    key5: '4,638.78',
    key6: '3,757.41',
    key7: '4,174.90',
    key8: '8.87',
    key9: '4,156',
    key10: '65,582.32',
    key11: '3,119.37'
  },
  {
    sortIndex: 3,
    name: '福州',
    key1: '829.12',
    key2: '89.12%',
    key3: '7.56',
    key4: '100.72',
    key5: '3,711.02',
    key6: '3,005.93',
    key7: '3,339.92',
    key8: '7.09',
    key9: '3,699',
    key10: '52,465.85',
    key11: '2,495.50'
  },
  {
    sortIndex: 4,
    name: '蚌埠',
    key1: '588.20',
    key2: '88.22%',
    key3: '6.99',
    key4: '99.32',
    key5: '2,968.82',
    key6: '2,404.74',
    key7: '2,671.93',
    key8: '5.67',
    key9: '3292',
    key10: '41,972.68',
    key11: '1,996.40'
  },
  {
    sortIndex: 5,
    name: '天津',
    key1: '522.00',
    key2: '72.32%',
    key3: '5.27',
    key4: '80.52',
    key5: '2,375.05',
    key6: '1,923.79',
    key7: '2,137.55',
    key8: '4.54',
    key9: '2930',
    key10: '33,578.14',
    key11: '1,597.12'
  }
]
