<template>
  <div class="agreesive">
    <p>
      本系统（包含网页端平台：【 https://fc.glp168.com/ 】以及移动应用端，以下简称“普洛斯商业保理系统”）由普洛斯商业保理（重庆）有限公司（以下简称 “普洛斯商业保理”）所有和运营，旨在依据本协议的约定为普洛斯商业保理系统用户（以下简称“用户”）提供商业保理相关服务（以下简称“系统服务”）。
      <strong>为了保证用户的权益，普洛斯商业保理特别提醒用户认真阅读本协议、充分理解各条款内容后再选择是否接受本协议。用户一经注册或使用系统服务，即视为用户已经完全理解本协议的全部内容并自愿接受本协议的全部条款。</strong>
    </p>
    <p>
      在协议履行过程中，普洛斯商业保理可根据实际情况对协议的相关条款进行修改变化。
      <strong>一旦协议内容发生变动，普洛斯商业保理将公布最新的服务协议，不再向用户作个别通知。如果用户不同意普洛斯商业保理对协议所做的修改，应立即停止使用系统服务。如果用户继续使用系统服务，则视为接受普洛斯商业保理对协议所做的修改，并应遵照修改后的协议履行应尽义务。</strong>
    </p>
    <h3>第一条 注册</h3>
    <p>一、在使用系统服务前，用户必须在普洛斯商业保理系统完成注册，成为普洛斯商业保理系统的用户。</p>
    <p>二、普洛斯商业保理系统的用户必须符合以下任一条件：</p>
    <p>1、符合中华人民共和国法律规定的具有民事权利能力和完全民事行为能力，能够独立承担民事责任的自然人；</p>
    <p>2、根据中华人民共和国（不包含港澳台地区）相关法律有效注册成立的企业法人；</p>
    <p>3、根据香港特别行政区、澳门特别行政区、台湾地区或外国（地区）法律有效成立的企业法人。</p>
    <p>若用户违反前述限制注册使用普洛斯商业保理系统的，实际账户使用人或相关监护人应承担所有责任。</p>

    <p>三、用户有义务确保用户资料信息的真实性、完整性和有效性，并承诺对用户资料信息及时进行更新。若普洛斯商业保理经判断认定用户资料存在错误、虚假、过时的嫌疑，普洛斯商业保理有权终止用户账户。由此产生的损失，普洛斯商业保理不承担任何责任。</p>
    <p>四、用户有义务提供有效的联系方式，包括但不限于手机号码、电话号码、通讯地址、常用电子邮箱、联系人信息等。联系方式发生变更时，应在5日内进行更新。因用户未提供有效联系方式，导致普洛斯商业保理未能提供服务时，造成的损失及法律后果，由用户自行承担。</p>
    <p>五、用户不应将其账号、密码转让、出售或出借予除用户本人或被授权人以外的第三方使用，如果普洛斯商业保理发现使用者并非账号注册者本人或被授权人的，有权停止继续服务。如用户发现其账号遭他人非法使用，应立即通知普洛斯商业保理。因黑客行为或用户违反本协议规定导致账号、密码遭他人非法使用的，由用户承担因此导致的损失和一切法律责任，普洛斯商业保理不承担任何责任。</p>
    <p>
      六、
      <strong>用户知晓并同意，普洛斯商业保理有权从普洛斯集团旗下其他主体处获取用户提供的或者留存的全部信息和数据。用户同意并授权普洛斯商业保理了解、收集并保存用户在申请或使用系统服务时向普洛斯商业保理及其合作方提供或形成的信息和数据。</strong>
    </p>
    <p>本条所称“普洛斯集团”是指普洛斯投资（上海）有限公司、普洛斯金融控股（重庆）有限公司及以上两家公司直接或间接控股的公司。</p>
    <p>七、本协议条款及任何其他用户在使用系统服务期间产生的协议、信息或其他通知，用户同意普洛斯商业保理通过平台公告、站内信、电子邮件、手机短信等电子方式或邮寄、专人快递等方式进行，用户应自行密切关注其自身的站内信箱、电子邮箱、手机短信、纸质信件等，因信息传输、用户自身查收延迟或遗漏等原因导致用户未在前述通知发出当日收到该等通知的，普洛斯商业保理不承担任何责任。</p>
    <h3>第二条 实名认证</h3>
    <p>一、普洛斯商业保理为符合条件的适格实名用户提供商业保理服务（以下简称“商业保理服务”），用户通过本系统可进行保理额度提用申请、提现等，具体以普洛斯商业保理当时提供于用户的商业保理服务内容为准。</p>
    <p>二、用户按照普洛斯商业保理的要求提交相关风控材料提出保理申请的，普洛斯商业保理有权接受或拒绝该申请，或要求用户更正、补交资料。</p>
    <p>三、用户同意并授权普洛斯商业保理将其姓名、身份证号、手机号码、企业法人统一社会信用代码证等要素提交至合法成立的相关机构进行真实性、准确性和有效性的核实认证。</p>
    <p>四、系统服务需要用户完成实名认证才能使用。用户因未完成实名认证而无法使用系统服务的，普洛斯商业保理不承担任何责任。用户应按照平台规定的流程和要求提交身份信息以及其他普洛斯商业保理要求的信息，并根据平台的流程完成实名认证。平台亦可能要求用户进行银行卡认证等操作，用户应使用以用户名义登记的银行卡完成银行卡认证等流程。</p>
    <h3>第三条 用户的权利与义务</h3>
    <p>一、用户同意并保证其绝不为任何非法目的或以任何非法方式利用平台的服务从事侵害他人权益或违法行为，并承诺遵守中国相关法律及所有相关规则。因违背上述承诺造成的损失及后果，用户自行负全部责任。</p>
    <p>
      二、用户应妥善保管自己的账号密码等账号信息，不对除被授权人以外的其他任何人泄露账号或密码。
      <strong>用户同意，确保账户安全是用户的责任，通过用户账户所进行的一切操作，发布的一切言论，都视为用户的行为及其真实意图的表达，所有损失及法律后果由用户自行承担。</strong>
    </p>
    <p>三、基于互联网的特殊性，普洛斯商业保理不承诺服务不会中断，也不承诺服务的安全性，用户对此应理解并确认。由于系统维护、设备故障、黑客攻击及其他不可抗力的影响，而导致用户无法正常使用相关服务时，普洛斯商业保理不承担任何责任。</p>
    <p>
      四、
      <strong>用户知晓并同意，平台的内容可能涉及由第三方所有、控制或者运营的其他网站（以下简称“第三方网站”）。普洛斯商业保理不能保证也没有义务保证第三方网站上任何信息的真实性和有效性。用户确认按照第三方网站的服务协议使用第三方网站，而不是按照本协议或普洛斯商业保理的其他任何规则。第三方网站不是普洛斯商业保理推荐或者介绍的，第三方网站的内容、项目、广告和其他任何信息均由用户自行判断并承担风险，而与普洛斯商业保理无关。用户经由普洛斯商业保理使用下载或取得任何资料，应由用户自行考量且自负风险，因资料的下载（如涉及）而导致的任何损坏由用户自行承担。</strong>
    </p>
    <p>
      五、
      <strong>用户理解并接受，用户可能通过普洛斯商业保理的第三方合作伙伴渠道登陆本系统。此种情况下，普洛斯商业保理不承担可能会发生用户身份验证风险以及由此造成的业务风险后果。</strong>
    </p>
    <p>
      六、
      <strong>普洛斯商业保理无需用户同意即可向第三方转让用户在普洛斯商业保理系统签署的相关合同项下的全部或部分权利和义务。未经普洛斯商业保理事先书面同意，用户不得转让其在本协议项下的任何权利和义务。</strong>
    </p>
    <h3>第四条 隐私保护</h3>
    <p>一、用户知晓并同意，普洛斯商业保理可能自公开及私人资料来源收集用户的额外资料，以更好地掌握用户情况，对用户进行信用审核、对提供的商业保理服务进行风险管理等。</p>
    <p>
      二、
      <strong>用户授权普洛斯商业保理可在用户商业保理服务业务申请阶段及业务存续期间向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会查询用户的信用信息，查询的信用信息包括但不限于负债信息及偿债履约能力判断信息。</strong>
    </p>
    <p>三、普洛斯商业保理对于用户提供的、普洛斯商业保理自行收集的用户信息享有使用和披露的权利。普洛斯商业保理基于融资资金追索、债权管理等操作、提供服务、解决争议、保障交易安全、等目的使用用户信息资料时，无需告知用户。</p>
    <p>
      四、
      <strong>普洛斯商业保理按照用户在平台上的行为自动追踪关于用户的某些资料。在不透露用户的隐私资料的前提下，普洛斯商业保理有权对整个用户数据库进行分析并对用户数据库进行商业上的利用。</strong>
    </p>
    <p>五、普洛斯商业保理采用行业标准和惯例保护用户信息。普洛斯商业保理不会将用户信息恶意出售给任何第三方。鉴于技术限制，普洛斯商业保理无法确保用户信息完全不被泄露。</p>
    <p>六、普洛斯商业保理有义务根据有关法律要求向司法机关和政府部门提供用户的资料。</p>
    <p>
      七、
      <strong>用户同意并授权普洛斯商业保理向中国人民银行金融信用信息基础数据库以及经国务院或其他政府有权部门批准合法设立的征信机构、中国互联网金融协会报送用户信用信息，报送的信用信息包括但不限于负债信息及偿债履约能力判断信息。</strong>
    </p>
    <p>
      八、
      <strong>若用户未能按照其与普洛斯商业保理签订的协议等法律文本的约定履行应尽义务，普洛斯商业保理有权披露用户信息及违约事实。普洛斯商业保理有权将上述信息写入网站黑名单，且与任何第三方进行数据共享，以供网站及第三方审核、催收之用。由此给用户造成的任何损失，普洛斯商业保理不承担法律责任。</strong>
    </p>
    <h3>第五条 知识产权的保护</h3>
    <p>一、平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、平台架构、平台画面的安排、网页设计，均由普洛斯商业保理或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>
    <p>二、用户应遵守关于知识产权保护的义务。非经普洛斯商业保理或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表平台程序或内容。否则，应承担相应的法律责任。</p>
    <h3>第六条 其他约定</h3>
    <p>一、本协议适用于用户在普洛斯商业保理系统的一切活动。协议内容包括但不限于协议正文条款，已发布的或将来可能发布的各类规则，都应视为协议不可分割的一部分，与协议正文条款享有同等法律效力。</p>
    <p>二、如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，本协议的其他条款仍然完全有效并具有约束力。</p>
    <p>
      三、本协议及其组成、修订的有效性、履行、解释以及与本协议及其修订效力有关的所有事宜，将受中国（即中华人民共和国，为本协议之目的，不包括香港特别行政区、澳门特别行政区和台湾地区，下同）法律管辖，任何争议仅适用中国法律。
      四、因本协议所引起的用户与普洛斯商业保理的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此完全同意将纠纷或争议提交普洛斯商业保理住所地人民法院诉讼解决。
    </p>
  </div>
</template>

<script lang="ts">
import { Vue, Component, Ref } from 'vue-property-decorator'

@Component
export default class Document extends Vue {
  $style!: any
}
</script>

<style lang="scss" module>
.pageTop {
  @extend .flex;
  @extend .bold;
  @extend .alignCenter;
  @extend .margin24;
  @extend .padding10;
}
.box {
  @extend .margin24;
  @extend .inline-block;
  @extend .width100;
}
.agree {
  @extend .textC;
  margin: 100px 0;
}
.flex {
  display: flex;
}
.width100 {
  width: 100%;
}
.bold {
  font-weight: bold;
}
.alignCenter {
  align-items: center;
}
.padding10 {
  padding: 10px;
}
.margin24 {
  margin: 24px 0;
}
.inline-block {
  display: inline-block;
}
.textC {
  text-align: center;
}
.agreesive{
    p{
        text-indent: 24px;
        line-height: 22px;
    }
    h3{
        width: 100%;
        text-align: center;
    }
}
</style>
