<template>
  <div class="max-area">
    <!-- tab组件 -->
    <div class="flex-ju-al-between mb-12">
      <ysn-tabs
        :list="tabs_list"
        :active="tab_active"
        @change="handleChange"
      />
      <ysn-btn>提交审批</ysn-btn>
    </div>
    <!-- 表格组件 -->
    <ysn-table
      :checkbox="tab_active==2?false:true"
      :data="tableData"
      :column="tableConfig"
      select-key="id"
      show-operation
    >
      <!-- 操作列插槽 -->
      <template>
        <ysn-btn type="text">详情</ysn-btn>
      </template>
    </ysn-table>
  </div>

</template>

<script>
export default {
  name: 'OriginalUnit',
  props: {
  },
  data() {
    return {
      tab_active: 0, // 切换的位置
      tabs_list: [ // tab配置
        { label: '收入' }, { label: '费用支出' }, { label: '汇总' }
      ],
      tableData: [ // 表格数据(模拟假数据)
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' },
        { t1: '项目1', t2: '111111', t3: '1111243434', t4: '222', t5: '333', t6: '777', t7: 'xxx' }
      ]

    }
  },
  computed: {
    // 切换展示不同的表格
    tableConfig() {
      // 收入表单配置
      const income = [
        { idx: '序号', type: 'index', width: '70px' },
        { t1: '主要部门', sortable: true },
        { t2: '收入表', sortable: true },
        { t3: '状态', sortable: true },
        { t4: '最后编辑人', sortable: true }
      ]
      // 费用支出
      const expenses = [
        { idx: '序号', type: 'index', width: '70px' },
        { t1: '主要部门', sortable: true },
        { t5: '费用支出表', sortable: true },
        { t3: '状态', sortable: true },
        { t4: '最后编辑人', sortable: true },
        { t6: '最后编辑时间', sortable: true }

      ]
      // 汇总
      const summary = [
        { idx: '序号', type: 'index', width: '70px' },
        { t7: '汇总表', sortable: true },
        { t3: '状态', sortable: true },
        { t4: '最后编辑人', sortable: true },
        { t6: '最后编辑时间', sortable: true }
      ]
      if (this.tab_active === 0) {
        return [
          ...income
        ]
      }
      if (this.tab_active === 1) {
        return [
          ...expenses
        ]
      }
      if (this.tab_active === 2) {
        return [
          ...summary
        ]
      }
    }
  },
  methods: {
    //  切换事件
    handleChange(event) {
      console.log(event.name)
      this.tab_active = parseInt(event.name)
    }
  }
}
</script>
