let columnconfig = {
	tablecolumn1: [
		{
			label: "序列",
			key: 'No',
			width: '60px',
			align: "left",
		},
		{
			label: "应用名称",
			key: "key1",
			align: "left",
		},
		{
			label: "服务名称",
			key: "key2",
			align: "left",
		},
		{
			label: "错误代码",
			key: "key3",
			align: "left",
		},
		{
			label: "错误信息",
			key: "key4",
			align: "left",
		},
		{
			label: "接收时间",
			key: "key5",
			align: "left",
		},
		{
			label: "操作",
			key: "function",
			align: "left",
			width: '140px',
			functionList: [
				{
					name: '详情',
					function: 'viewFunc',
					color: '#4876EF'
				}
			]
		}
	],
	tableList: [
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
		{
			key1: '会计平台',
			key2: '登录',
			key3: '401',
			key4: '签名验证失败',
			key5: '202-02-02 00:00:00',
		},
	]
}
export default columnconfig
